In [20]:
import sqlite3
import pandas as pd

def create_connection(path):
    connection=sqlite3.connect(path)
    return(connection)

connection = create_connection("testing3.sqlite")

In [21]:
df = pd.read_csv("courses.csv")
df.to_sql("courses", connection, if_exists='append', index =False)

In [23]:
dg = pd.read_csv("assessments.csv", sep=";")
dg.to_sql("assessments", connection, if_exists='append', index =False)

In [24]:
dh = pd.read_csv("C:\hdsft_SQL\studentInfo.csv", sep=",")
dh.to_sql("studentInfo", connection, if_exists='append', index =False)

In [25]:
di = pd.read_csv("C:\hdsft_SQL\studentAssessment.csv", sep=",")
di.to_sql("studentAssessments", connection, if_exists='append', index =False)

In [26]:
dj = pd.read_csv("C:\hdsft_SQL\studentRegistration.csv", sep=",")
dj.to_sql("studentRegistration", connection, if_exists='append', index =False)

In [27]:
#Query No select
def execute_command(conn,query):
    cur = conn.cursor()
    cur.execute(query)
    conn.commit()

In [28]:
#Query select
def select_query(conn,query):
    cur = conn.cursor()
    cur.execute(query)
    rows = cur.fetchall()
    
    for row in rows:
        print(row)

In [29]:
df

   code_module code_presentation  module_presentation_length
0          AAA             2013J                         268
1          AAA             2014J                         269
2          BBB             2013J                         268
3          BBB             2014J                         262
4          BBB             2013B                         240
5          BBB             2014B                         234
6          CCC             2014J                         269
7          CCC             2014B                         241
8          DDD             2013J                         261
9          DDD             2014J                         262
10         DDD             2013B                         240
11         DDD             2014B                         241
12         EEE             2013J                         268
13         EEE             2014J                         269
14         EEE             2014B                         241
15         FFF             2013J                         268
16         FFF             2014J                         269
17         FFF             2013B                         240
18         FFF             2014B                         241
19         GGG             2013J                         261
20         GGG             2014J                         269
21         GGG             2014B                         241

In [30]:
dg

,code_module,code_presentation,id_assessment,assessment_type,date,weight
0,AAA,2013J,1752,TMA,19.0,10.0
1,AAA,2013J,1753,TMA,54.0,20.0
2,AAA,2013J,1754,TMA,117.0,20.0
3,AAA,2013J,1755,TMA,166.0,20.0
4,AAA,2013J,1756,TMA,215.0,30.0
...,...,...,...,...,...,...
201,GGG,2014J,37443,CMA,229.0,0.0
202,GGG,2014J,37435,TMA,61.0,0.0
203,GGG,2014J,37436,TMA,124.0,0.0
204,GGG,2014J,37437,TMA,173.0,0.0
205,GGG,2014J,37444,Exam,229.0,100.0

In [31]:
dh

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass
...,...,...,...,...,...,...,...,...,...,...,...,...
32588,GGG,2014J,2640965,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail
32589,GGG,2014J,2645731,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction
32590,GGG,2014J,2648187,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass
32591,GGG,2014J,2679821,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn
32592,GGG,2014J,2684003,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction

In [32]:
di

        id_assessment  id_student  date_submitted  is_banked  score
0                1752       11391              18          0   78.0
1                1752       28400              22          0   70.0
2                1752       31604              17          0   72.0
3                1752       32885              26          0   69.0
4                1752       38053              19          0   79.0
...               ...         ...             ...        ...    ...
173907          37443      527538             227          0   60.0
173908          37443      534672             229          0  100.0
173909          37443      546286             215          0   80.0
173910          37443      546724             230          0  100.0
173911          37443      558486             224          0   80.0

[173912 rows x 5 columns]

In [33]:
dj

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN
...,...,...,...,...,...
32588,GGG,2014J,2640965,-4.0,NaN
32589,GGG,2014J,2645731,-23.0,NaN
32590,GGG,2014J,2648187,-129.0,NaN
32591,GGG,2014J,2679821,-49.0,101.0
32592,GGG,2014J,2684003,-28.0,NaN

In [34]:
Q = '''
Create Table Mardigu(
    id integer primary key AUTOINCREMENT,
    school_id integer,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date date,
    salary numeric,
    FOREIGN KEY (school_id) REFERENCES schools(id)
    );
'''

execute_command(connection,Q)

OperationalError: table Mardigu already exists

In [35]:
query = '''
INSERT INTO Mardigu (school_id, first_name, last_name, school, hire_date, salary)
 VALUES (2, 'Janet', 'Smith', 'F. D. Roosevelt HS', '2011-10-30', 36200),
        (1, 'Lee','Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
        (3, 'Farand','Austen','F.D. Roosevelt HS', '1996-10-25', 75000),
        (4, 'Lee','Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
        (5, 'Farand','Austen','F.D. Roosevelt HS', '1996-10-31', 75000),
        (6, 'Vallian', 'Audrey', 'F.D. Roosevelt HS', '2000-12-31', 45000);
'''

execute_command(connection,query)

In [36]:
select_query(connection, "select * from Mardigu")

(1, 2, 'Janet', 'Smith', 'F. D. Roosevelt HS', '2011-10-30', 36200)
(2, 1, 'Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000)
(3, 3, 'Farand', 'Austen', 'F.D. Roosevelt HS', '1996-10-25', 75000)
(4, 4, 'Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000)
(5, 5, 'Farand', 'Austen', 'F.D. Roosevelt HS', '1996-10-31', 75000)
(6, 6, 'Vallian', 'Audrey', 'F.D. Roosevelt HS', '2000-12-31', 45000)
(7, 2, 'Janet', 'Smith', 'F. D. Roosevelt HS', '2011-10-30', 36200)
(8, 1, 'Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000)
(9, 3, 'Farand', 'Austen', 'F.D. Roosevelt HS', '1996-10-25', 75000)
(10, 4, 'Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000)
(11, 5, 'Farand', 'Austen', 'F.D. Roosevelt HS', '1996-10-31', 75000)
(12, 6, 'Vallian', 'Audrey', 'F.D. Roosevelt HS', '2000-12-31', 45000)

In [37]:
dat = pd.read_sql_query("select *from Mardigu", connection)

In [38]:
dat

    id  school_id first_name last_name              school   hire_date  salary
0    1          2      Janet     Smith  F. D. Roosevelt HS  2011-10-30   36200
1    2          1        Lee  Reynolds   F.D. Roosevelt HS  1993-05-22   65000
2    3          3     Farand    Austen   F.D. Roosevelt HS  1996-10-25   75000
3    4          4        Lee  Reynolds   F.D. Roosevelt HS  1993-05-22   65000
4    5          5     Farand    Austen   F.D. Roosevelt HS  1996-10-31   75000
5    6          6    Vallian    Audrey   F.D. Roosevelt HS  2000-12-31   45000
6    7          2      Janet     Smith  F. D. Roosevelt HS  2011-10-30   36200
7    8          1        Lee  Reynolds   F.D. Roosevelt HS  1993-05-22   65000
8    9          3     Farand    Austen   F.D. Roosevelt HS  1996-10-25   75000
9   10          4        Lee  Reynolds   F.D. Roosevelt HS  1993-05-22   65000
10  11          5     Farand    Austen   F.D. Roosevelt HS  1996-10-31   75000
11  12          6    Vallian    Audrey   F.D. Roosevelt HS  2000-12-31   45000

In [39]:
connection = create_connection("testing4.sqlite")

In [47]:
dis = pd.read_sql_query
("SELECT studentAssessment.id_student, studentInfo.region, courses.code_module, assessments.assessment_type, studentAssessment.score FROM courses join assessments on courses.code_presentation = assessments.code_presentation join studentInfo on assessments.code_presentation = studentInfo.code_presentation join studentAssessment on assessments.id_assessment = studentAssessment.id_assessment join studentRegistration on courses.code_presentation = studentRegistration.code_presentation WHERE courses.code_presentation = '2014B'", connection)

("SELECT studentAssessment.id_student, studentInfo.region, courses.code_module, assessments.assessment_type, studentAssessment.score FROM courses join assessments on courses.code_presentation = assessments.code_presentation join studentInfo on assessments.code_presentation = studentInfo.code_presentation join studentAssessment on assessments.id_assessment = studentAssessment.id_assessment join studentRegistration on courses.code_presentation = studentRegistration.code_presentation WHERE courses.code_presentation = '2014B'",
 <sqlite3.Connection at 0x1ffb3f98d50>)

In [48]:
Farand

<function pandas.io.sql.read_sql_query(sql, con, index_col=None, coerce_float=True, params=None, parse_dates=None, chunksize: Union[int, NoneType] = None) -> Union[pandas.core.frame.DataFrame, Iterator[pandas.core.frame.DataFrame]]>